<template>
	<div class="menu">
		<h2>Window 弹出框</h2>
		<p>模态对话框，在浮层中显示，引导用户进行相关操作。</p>
		<h3>示例</h3>
		<Button text="显示弹出框" @on-click="isShow = true" />
		<div class="items">
			<Window v-model="isShow" :height="600" title="写给未来的你">
                亲，展信佳。<br>
                最近还好吗？一定有这样那样的难处吧？我也是呢，最近在这个坑道里，都断粮好几天了。
                不过还好，在下一轮炮火来临前，鹰酱他们应该还不会冲上来。
                趁着这个时候，赶紧给亲写一封信，聊聊天。
                亲啊，你说，什么时候才不用打仗呢？之前和脚盆鸡打过，和秃子打过，现在又和鹰酱打。
                每次都是别人逼着你和他硬刚。
                你不打，人家就要欺负你。
                我也想过点太平日子，但是不拿出点骨气来，光靠乞求，是换不来太平日子的。
                我听几个留样回来的亲们说，鹰酱家那边其实很富有：
                有很多很多的高楼，有很多很多的工厂，有很多很多的汽车……你说，
                到你们那代，会有那么多的高楼，
                那么多的汽车吗？呵呵呵，想太多，
                我其实在想，种花家外的仗能打完，
                我就能和其他亲们，一起回家种地……争取，
                争取，家家种地，顿顿吃饱，过年有新衣服穿，
                最好，能顿顿都吃上肉……亲，
                我写这封信给你，没有别的意思。
                我就想知道，到你们这个时代，
                是不是能吃饱穿暖，是不是能安安稳稳的过自己的日子，
                是不是能堂堂正正的走出去，不会被人笑话“东亚病夫”，
                是不是能实现我们的大国梦呢？要是以后，
                有这么多有文化的亲，种花家一定也会更快速的发展吧？
                啊，鹰酱炮火齐射了，就先聊到这里。
                要是……要是我回不来种花家了，请一定记得我，记得一只为了那个大国梦所奋斗过的我。生命不息，冲锋不止。前进！前进！！前进！！！
			</Window>
		</div>
		<h3>代码</h3>
		<div class="code" ref="code">
		</div>
		<h3>属性</h3>
		<Table :items="props">
			<Thead title="属性" width="20" />
			<Thead title="说明" width="140" />
			<Thead title="类型" width="40" />
			<Thead title="默认值" width="40" />
		</Table>
		<h3>事件</h3>
		<Table :items="events">
			<Thead title="事件名" width="20" />
			<Thead title="说明" width="140" />
			<Thead title="返回值" width="40" />
		</Table>
	</div>
</template>

<script>
export default {
	data(){
		return {
			isShow: false,
			props:[
				["value", "是否显示弹出框,支持v-model双向绑定","Boolean","false"],
				["title", "弹出框标题","String","提示"],
				["height", "弹出框的高度","Number","300"],
				["width", "弹出框的宽度", "Number", "570"],
				["okText", "确认按钮文字", "String", "确定"],
				["cancelText", "取消按钮的文字", "String", "取消"]
			],
			events:[
				["onOk","点击确定按钮触发的事件","-"],
				["onCancel", "点击取消按钮触发的事件", "-"]
			]
		}
	},
	mounted(){
		this.$refs.code.innerText = `<Window v-model="isShow" :height="600" title="写给未来的你">
                亲，展信佳。<br>
                最近还好吗？一定有这样那样的难处吧？我也是呢，最近在这个坑道里，都断粮好几天了。
                不过还好，在下一轮炮火来临前，鹰酱他们应该还不会冲上来。
                趁着这个时候，赶紧给亲写一封信，聊聊天。
                亲啊，你说，什么时候才不用打仗呢？之前和脚盆鸡打过，和秃子打过，现在又和鹰酱打。
                每次都是别人逼着你和他硬刚。
                你不打，人家就要欺负你。
                我也想过点太平日子，但是不拿出点骨气来，光靠乞求，是换不来太平日子的。
                我听几个留样回来的亲们说，鹰酱家那边其实很富有：
                有很多很多的高楼，有很多很多的工厂，有很多很多的汽车……你说，
                到你们那代，会有那么多的高楼，
                那么多的汽车吗？呵呵呵，想太多，
                我其实在想，种花家外的仗能打完，
                我就能和其他亲们，一起回家种地……争取，
                争取，家家种地，顿顿吃饱，过年有新衣服穿，
                最好，能顿顿都吃上肉……亲，
                我写这封信给你，没有别的意思。
                我就想知道，到你们这个时代，
                是不是能吃饱穿暖，是不是能安安稳稳的过自己的日子，
                是不是能堂堂正正的走出去，不会被人笑话“东亚病夫”，
                是不是能实现我们的大国梦呢？要是以后，
                有这么多有文化的亲，种花家一定也会更快速的发展吧？
                啊，鹰酱炮火齐射了，就先聊到这里。
                要是……要是我回不来种花家了，请一定记得我，记得一只为了那个大国梦所奋斗过的我。生命不息，冲锋不止。前进！前进！！前进！！！
</Window>`
	}
}
</script>

<style scope>
.items > div{
	margin-bottom: 20px;
}
</style>

